---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPSupportFailures.InstanceProfileNotMatchWithHostError
source: html/5b40d8de-ea17-5bbd-6abd-80d7df3cfeb9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPSupportFailures.InstanceProfileNotMatchWithHostError Property

The [Symbol]'s profile does not match the host. Instances of [Symbol] will be deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId InstanceProfileNotMatchWithHostError { get; }
```